Revit 2024 API
InSessionViewSheetSet.IsAutomatic Property
 Automatic order or manual order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool IsAutomatic { get; set; }
Visual Basic
Public Overridable Property IsAutomatic As Boolean
	Get
	Set
Visual C++
public:
virtual property bool IsAutomatic {
	bool get ();
	void set (bool value);
}
Implements
IViewSheetSet.IsAutomatic
See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace